_posts/2014-09-19-git.html
---
category: computer science and enginneering
layout: post
title: "Notes of Git"
Tags: [linux,tools,git]
---
{% include JB/setup %}

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">命令速记</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>git init
</li>
<li>git add .    :递归的将当前目录下的所有内容添加到仓库
</li>
<li>git commit -m "comments&#x2026;" : 将git add添加的内容提交到仓库
</li>
<li>git branch -r
</li>
<li>git checkout -b 3dc9935 bloom/master
</li>
<li>git ls-remote &#x2013;heads origin
</li>
<li>git ls-remote bloom | grep refs/heads/
</li>
</ul>

<pre class="example">
cd /gitcentor
git clone --bare /study/doctor/cloudstorage/stream-process/bloom /gitcentor/bloom.git 
 :This clone command copies the Git remote repository from /study/doctor/cloudstorage/stream-process/bloom to the current working directory, /gitcentor/.
git remote add bloom /gitcentor/bloom  :git remote added a new remote section called origin to our configuration
</pre>

<ul class="org-ul">
<li>git push &lt;仓库明&gt; master 将本地内容提交到远程仓库
</li>
<li>git 
</li>
<li>git branch -r
</li>

<li>git checkout -b 3dc9935 bloom/master
</li>
<li>git ls-remote &#x2013;heads origin
</li>
<li>git ls-remote bloom | grep refs/heads/
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">creating one remote repository</h2>
<div class="outline-text-2" id="text-2">
<p>
In machine1, whose ip is 192.168.1.101 and user name borealis, it
has a directory nmstl. In machine2, whose ip is 192.168.1.106 and
user name abelard. 
I create one remote repository in machine2's directory
/research/git-center, and machine1 is nmstl's developing machine.
</p>

<p>
First, in machine1
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> ~/nmstl
git init
git add .
git commit -m <span style="color: #8abeb7;">"nmstl project"</span>
</pre>
</div>

<p>
Second, in machine2
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> /research/git-center
git clone --bare borealis@192.168.1.106:~/nmstl nmstl-fc12-i386
</pre>
</div>

<p>
Third, in machine1, I get nmstl's newest version.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> ~/test-nmstl-git
git clone abelard@192.168.1.103:/research/git-center/nmstl
</pre>
</div>

<p>
Forth, after modifying.
</p>
<div class="org-src-container">

<pre class="src src-sh">git clone abelard@192.168.1.103:/research/git-center/nmstl
git push origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">commit only modified files</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh">git diff --name-only --diff-filter=M | xargs git add
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">建立一个可以进行push的裸仓库(一般是在git服务器中构建)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-sh">mkdir gitTest.git
<span style="color: #b294bb;">cd</span> gitTest.git
git init --bar
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">第一次向远程仓库push内容的操作</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-sh">mkdir gitTest
<span style="color: #b294bb;">cd</span> gitTest
touch Readme
git init
git add .
git commit -m <span style="color: #8abeb7;">"write some comments"</span>
git remote add origin abelard@10.13.32.243:/path/gitTest.git
git push origin master
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">从远程仓库中克隆内容和提交更新</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sh">git clone abelard@10.13.32.243:/path/gitTest.git
<span style="color: #b294bb;">cd</span> gitTest
touch newfile
git add newfile  <span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">&#21487;&#20197;&#26159;&#30446;&#24405;&#65292;&#25110;&#25991;&#20214;&#36335;&#24452;</span>
git commit -m <span style="color: #8abeb7;">"update version"</span>
git push origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">github 相关</h2>
<div class="outline-text-2" id="text-7">
<p>
如果是第一次使用并且想创建public库，则需要登录github创建用户并且创建自己喜欢仓库。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;">## </span><span style="color: #969896; font-style: italic;">&#21019;&#24314;ssh key ##</span>
        <span style="color: #b294bb;">cd</span> ~/.ssh
        ssh-keygen -t rsa -C <span style="color: #8abeb7;">"your_email@example.com"</span>
        sudo yum install xclip
        xclip -sel clip &lt; ~/.ssh/id_rsa.pub
</pre>
</div>
<p>
上面的操作在本地linux下完成，详细解释在<a href="https://help.github.com/articles/generating-ssh-keys">ssh-key</a>, 最后一个命令是将本地key的内容拷贝到剪贴板，然后登录github,找到SSH Key页面，选择Add an SSH Key，按ctrl+v拷贝到编辑框即可.
</p>
<ul class="org-ul">
<li>测试ssh key 
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">        [abelard@abelard ~]$ ssh -T git@github.com

Hi pengchengzhang! You<span style="color: #8abeb7;">'ve successfully authenticated, but</span>
<span style="color: #8abeb7;">GitHub does not provide shell access.</span>
</pre>
</div>
<ul class="org-ul">
<li>遇到问题
</li>
</ul>
<p>
如果以上测试命令遇到如下问题：
</p>
<div class="org-src-container">

<pre class="src src-sh">Agent admitted failure to sign using the key.

<span style="color: #8abeb7;">\#</span> debug1: No more authentication methods to try.

<span style="color: #8abeb7;">\#</span> Permission denied (publickey)<span style="color: #b294bb;">.</span>
</pre>
</div>
<p>
执行：ssh-add 命令，应该能得到如下信息：
</p>
<div class="org-src-container">

<pre class="src src-sh">Identity added: /home/abelard/.ssh/id_rsa
(/home/abelard/.ssh/id_rsa)
</pre>
</div>
<p>
再重复以上测试命令，应该就ok了。
</p>

<ul class="org-ul">
<li>上传项目有关的命令
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">git init
git add .
git file -m <span style="color: #8abeb7;">"comments"</span>
git remote add orign
git@github.com:pengchengzhang/bloom-chord.git
git push -u orign master
</pre>
</div>
<p>
最后两个命令必须是在以上测试没有问题的情况下进行。
</p>
</div>
</div>
